# FaceSculptingFaceLoss Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SculptingFailures..::..FaceSculptingFaceLoss Property
BuiltInFailures..::..SculptingFailures Class See Also
---
The original sculpted face is lost.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId FaceSculptingFaceLoss { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FaceSculptingFaceLoss As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ FaceSculptingFaceLoss {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SculptingFailures Class
Autodesk.Revit.DB Namespace